alefragnani.project-manager
charliermarsh.ruff
davidanson.vscode-markdownlint
editorconfig.editorconfig
github.copilot
github.copilot-chat
mhutchie.git-graph
ms-azuretools.vscode-azureresourcegroups
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-renderers
ms-vscode-remote.remote-wsl
ms-windows-ai-studio.windows-ai-studio
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-british-english
teamsdevapp.vscode-ai-foundry
vstirbu.vscode-mermaid-preview
yandeu.five-server
yzhang.markdown-all-in-one
